src/СРМ/src/Documents/ПланОбучения/ПланОбучения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПланОбучения</name>
  <registerRecords>AccumulationRegister.Обучение</registerRecords>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>CatalogRef.Курсы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Завершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Оценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Замечания</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>План</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьТема</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Длительность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьВыполнено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьДатаВыполнения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Урок</name>
      <type>
        <types>CatalogRef.Уроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Задача</name>
      <type>
        <types>DocumentRef.Задача</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/СРМ/src/Documents/Задача/Задача.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Задача</name>
  <basedOn>Document.Задача</basedOn>
  <registerRecords>AccumulationRegister.Трудозатраты</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыполнения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРаботПоЗадаче</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактОбращения</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DefinedType.ОснованиеЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаТрудозатрат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаТрудозатратИсполнителя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Редактор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскаяЗадача</name>
    <type>
      <types>DocumentRef.Задача</types>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Спринт</name>
    <type>
      <types>DocumentRef.Спринт</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполненияАвто</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Срочность</name>
    <type>
      <types>CatalogRef.СрочностиЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОплаты</name>
    <type>
      <types>CatalogRef.ВидыОплатыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеФормат</name>
    <type>
      <types>EnumRef.ВариантыОформленияТекста</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеHTML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияЗакрытия</name>
    <type>
      <types>CatalogRef.КатегорииЗакрытияЗадач</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПолучателиКопий</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>DefinedType.КонтактВзаимодействия</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОтправки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/СРМ/src/Catalogs/Курсы/Курсы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Курсы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Расположение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сложность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Рейтинг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Навыки</name>
    <attributes>
      <name>Навык</name>
      <type>
        <types>CatalogRef.Навыки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>План</name>
    <attributes>
      <name>Тема</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Длительность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/СРМ/src/Documents/ПланОбучения/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы



#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПлан

&НаКлиенте
Процедура ПланПередУдалением(Элемент, Отказ)
	
	Если ЗначениеЗаполнено(Элементы.План.ТекущиеДанные.Задача) Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПланВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ПланЗадача" Тогда
		ПоказатьЗначение(,Элементы.План.ТекущиеДанные.Задача);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьПоКурсу(Команда)
	ЗаполнитьПоКурсуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЗадачи(Команда)
	
	Если ЗадачиСформированы() Тогда
		ПоказатьПредупреждение(,"Задачи уже сформированы, повторное формирование не предусмотрено");
		Возврат;
	КонецЕсли;
	
	Если Модифицированность ИЛИ Не Объект.Проведен Тогда
		ПоказатьПредупреждение(,"Перед формированием задач нужно провести документ");
		Возврат;
	КонецЕсли;
	
	СформироватьЗадачиНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПоКурсуНаСервере()
	
	Объект.План.Очистить();
	
	Если Не ЗначениеЗаполнено(ПлановыеТрудозатратыВДень) Тогда
		ПлановыеТрудозатратыВДень = 2;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(РабочихДнейВНеделе) Тогда
		РабочихДнейВНеделе = 5;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПроцентЭффективности) Тогда
		ПроцентЭффективности = 100;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КурсыПлан.Тема КАК Тема,
	|	КурсыПлан.Длительность КАК Длительность
	|ИЗ
	|	Справочник.Курсы.План КАК КурсыПлан
	|ГДЕ
	|	КурсыПлан.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	КурсыПлан.НомерСтроки";
	Запрос.УстановитьПараметр("Ссылка", Объект.Курс);
	
	Выборка = Запрос.Выполнить().Выбрать();
		
	Если ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
		ДатаПлан = Объект.ДатаНачала;
	Иначе
		ДатаПлан = УчетВремениКлиентСервер.ДобавитьДень(НачалоДня(ТекущаяДатаСеанса()), 1);
	КонецЕсли;
	
	ПропуститьВыходные(ДатаПлан);
	
	ДоступноЧасов = ПлановыеТрудозатратыВДень;
	
	Пока Выборка.Следующий() Цикл
		
		ОсталосьРаспределить = Окр(Выборка.Длительность * 100 / ПроцентЭффективности, 2);
		
		Пока ОсталосьРаспределить > 0 Цикл
			
			Длительность = Мин(ОсталосьРаспределить, ДоступноЧасов);
			
			СтрокаПлана = Объект.План.Добавить();
		    СтрокаПлана.Дата = ДатаПлан;
			СтрокаПлана.Тема = Выборка.Тема;
			СтрокаПлана.Длительность = Длительность;
			
			ОсталосьРаспределить = ОсталосьРаспределить - Длительность;
			ДоступноЧасов = ДоступноЧасов - Длительность;
			
			Если ДоступноЧасов = 0 Тогда
				ДоступноЧасов = ПлановыеТрудозатратыВДень;
				ДатаПлан = УчетВремениКлиентСервер.ДобавитьДень(ДатаПлан, 1);
				ПропуститьВыходные(ДатаПлан);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПропуститьВыходные(ДатаПлан)
	
	ДеньНеделиДаты = ДеньНедели(ДатаПлан);
	Если ДеньНеделиДаты > РабочихДнейВНеделе Тогда
		ДобавитьДней = 8 - ДеньНеделиДаты;
		ДатаПлан = УчетВремениКлиентСервер.ДобавитьДень(ДатаПлан, ДобавитьДней);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ЗадачиСформированы()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПланОбученияПлан.Задача.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Задача КАК ДокЗадача
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПланОбучения.План КАК ПланОбученияПлан
	|		ПО (ПланОбученияПлан.Задача.Ссылка = ПланОбученияПлан.Задача)
	|ГДЕ
	|	НЕ ПланОбученияПлан.Задача.ПометкаУдаления
	|	И ПланОбученияПлан.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	Результат = Запрос.Выполнить();
	Возврат Не Результат.Пустой();
	
КонецФункции

&НаСервере
Функция СформироватьЗадачиНаСервере()
	
	СтруктураЗадачи = Новый Структура;
	СтруктураЗадачи.Вставить("Исполнитель", Объект.Пользователь);
	СтруктураЗадачи.Вставить("Проект", Объект.Проект);
	
	НачатьТранзакцию();
	
	Для Каждого Стр Из Объект.План Цикл
		
		РеквизитыУрока = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Стр.Урок, "Размещение,Описание");
		
		СтруктураЗадачи.Вставить("Основание", Стр.Урок);
		СтруктураЗадачи.Вставить("ОценкаТрудозатрат", Стр.Длительность);
		СтруктураЗадачи.Вставить("ОценкаТрудозатратИсполнителя", УправлениеЗадачамиКлиентСервер.ОценкаПоРядуФибоначчи(Стр.Длительность));
		СтруктураЗадачи.Вставить("СрокИсполнения", Стр.Дата);
		СтруктураЗадачи.Вставить("Тема", СтрШаблон("Изучить: %1 (Курс: %2)", Стр.Урок, Объект.Курс));
		
		СодержаниеЗадачи = "";
		Если ЗначениеЗаполнено(РеквизитыУрока.Описание) Тогда
			СодержаниеЗадачи = СодержаниеЗадачи + РеквизитыУрока.Описание + Символы.ПС;
		КонецЕсли;
		Если ЗначениеЗаполнено(РеквизитыУрока.Размещение) Тогда
			СодержаниеЗадачи = СодержаниеЗадачи + СтрШаблон("Размещение: %1", РеквизитыУрока.Размещение);
		КонецЕсли;
		СтруктураЗадачи.Вставить("Содержание", СодержаниеЗадачи);
		
		НоваяЗадача = Документы.Задача.СоздатьДокумент();
		НоваяЗадача.Заполнить(СтруктураЗадачи);
		НоваяЗадача.Записать(РежимЗаписиДокумента.Проведение);
		
		Стр.Задача = НоваяЗадача.Ссылка;
		
	КонецЦикла;
	
	Записать();
	
	ЗафиксироватьТранзакцию();
	
	Прочитать();

КонецФункции

#КонецОбласти
